fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускиСотрудников</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДнейОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ОтпускиСотрудников/ВКМ_ОтпускиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускиСотрудников</name>
  <resources>
    <name>ВКМ_ДнейОтпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ОтпускиСотрудников.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания КАК ДатаОкончания,
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.ВКМ_ДнейОтпуска КАК ДнейОтпуска
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ВКМ_ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковВКМ_ОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОтпускиСотрудников.Добавить();
		Движение.Период = Выборка.ДатаНачала;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Сотрудник = Выборка.Сотрудник;
		Движение.ВКМ_ДатаНачала = Выборка.ДатаНачала;
		Движение.ВКМ_ДатаОкончания = Выборка.ДатаОкончания;
		Движение.ВКМ_ДнейОтпуска = Выборка.ДнейОтпуска;
			
	КонецЦикла;
	 
КонецПроцедуры
